; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v7 - type_3)
 	      (pred_1 ?v5 - object ?v7 - type_3)
	      (pred_2 ?v2 - type_1 ?v8 - type_2)
	      (pred_3 ?v2 - type_1 ?v5 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v2 - type_1 ?v1 ?v4 - type_3)
       :precondition (and  (pred_4 ?v2 ?v1))
       :effect (and  (pred_4 ?v2 ?v4)
		     (not (pred_4 ?v2 ?v1))))

   (:action op_2
       :parameters (?v2 - type_1 ?v3 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v6) (pred_4 ?v2 ?v6) (pred_2 ?v2 ?v8))
       :effect (and (pred_3 ?v2 ?v3 ?v8)
		    (not (pred_1 ?v3 ?v6)) 
		    (not (pred_2 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_1 ?v3 - object ?v6 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v3 ?v8) (pred_4 ?v2 ?v6))
       :effect (and (pred_1 ?v3 ?v6)
		    (pred_2 ?v2 ?v8)
		    (not (pred_3 ?v2 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_03 obj_08 - type_1
obj_11 obj_10 obj_13 obj_02 - type_2
obj_06 obj_12 obj_09 obj_04 - type_3
obj_01 obj_05 obj_07 - object)
(:init
(pred_4 obj_03 obj_09)
(pred_2 obj_03 obj_11)
(pred_2 obj_03 obj_10)
(pred_4 obj_08 obj_09)
(pred_2 obj_08 obj_13)
(pred_2 obj_08 obj_02)
(pred_1 obj_01 obj_06)
(pred_1 obj_05 obj_04)
(pred_1 obj_07 obj_06)
)
(:goal
(and
(pred_1 obj_01 obj_04)
(pred_1 obj_05 obj_06)
(pred_1 obj_07 obj_06)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_04)))
)
)

; plan
1. (op_3 obj_03 obj_09 obj_06)
   deleted: (pred_4 obj_03 obj_09)
   added: (pred_4 obj_03 obj_06)
   goals met: 1 of 3
2. (op_3 obj_08 obj_09 obj_06)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_06)
   goals met: 1 of 3
3. (op_3 obj_03 obj_06 obj_12)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_12)
   goals met: 1 of 3
4. (op_2 obj_08 obj_01 obj_06 obj_02)
   deleted: (pred_1 obj_01 obj_06) (pred_2 obj_08 obj_02)
   added: (pred_3 obj_08 obj_01 obj_02)
   goals met: 1 of 3
5. (op_3 obj_08 obj_06 obj_04)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_04)
   goals met: 1 of 3
6. (op_1 obj_08 obj_01 obj_04 obj_02)
   deleted: (pred_3 obj_08 obj_01 obj_02)
   added: (pred_1 obj_01 obj_04) (pred_2 obj_08 obj_02)
   goals met: 2 of 3
7. (op_2 obj_08 obj_05 obj_04 obj_13)
   deleted: (pred_1 obj_05 obj_04) (pred_2 obj_08 obj_13)
   added: (pred_3 obj_08 obj_05 obj_13)
   goals met: 2 of 3
8. (op_3 obj_08 obj_04 obj_06)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_06)
   goals met: 2 of 3
9. (op_1 obj_08 obj_05 obj_06 obj_13)
   deleted: (pred_3 obj_08 obj_05 obj_13)
   added: (pred_1 obj_05 obj_06) (pred_2 obj_08 obj_13)
   goals met: 3 of 3
